<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Hierachical-Indexing" data-toc-modified-id="Hierachical-Indexing-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Hierachical Indexing</a></span></li><li><span><a href="#Reordering-and-Sorting-Levels" data-toc-modified-id="Reordering-and-Sorting-Levels-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Reordering and Sorting Levels</a></span><ul class="toc-item"><li><span><a href="#Cambiar-Nivel-(Swaplevel)" data-toc-modified-id="Cambiar-Nivel-(Swaplevel)-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Cambiar Nivel (Swaplevel)</a></span></li><li><span><a href="#Ordenar-por-niveles" data-toc-modified-id="Ordenar-por-niveles-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Ordenar por niveles</a></span></li><li><span><a href="#Indexing-with-a-DataFrame's-Columns" data-toc-modified-id="Indexing-with-a-DataFrame's-Columns-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Indexing with a DataFrame's Columns</a></span><ul class="toc-item"><li><span><a href="#Cambio-de-indice" data-toc-modified-id="Cambio-de-indice-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>Cambio de indice</a></span><ul class="toc-item"><li><span><a href="#set_index" data-toc-modified-id="set_index-2.3.1.1"><span class="toc-item-num">2.3.1.1&nbsp;&nbsp;</span>set_index</a></span></li><li><span><a href="#reset_index" data-toc-modified-id="reset_index-2.3.1.2"><span class="toc-item-num">2.3.1.2&nbsp;&nbsp;</span>reset_index</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Combining-and-Merging-Datasets" data-toc-modified-id="Combining-and-Merging-Datasets-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Combining and Merging Datasets</a></span></li></ul></div>

In [3]:
import pandas as pd 
import numpy as np

# Hierachical Indexing

pasar lista de lista como argumento en index con el orden respectivo

In [26]:
df = pd.DataFrame(np.arange(12).reshape((4, 3)))
df

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [27]:
df.index = [
     ['a','a','b','b'],
     [ 1 , 2 , 3 , 4 ]
]
df

     0   1   2
a 1  0   1   2
  2  3   4   5
b 3  6   7   8
  4  9  10  11

In [28]:
df.columns = [
    ['Ohio', 'Ohio', 'Colorado'],
    ['Green', 'Red', 'Green']
]
df

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 3     6   7        8
  4     9  10       11

tambien se pueden nombrar los niveles de las columnas y de los indices

In [25]:
df.index.names = ["fila_nivel_1","fila_nivel_2"]
df.columns.names = ["columna_nivel_1","columna_nivel_2"]
df

columna_nivel_1            Ohio     Colorado
columna_nivel_2           Green Red    Green
fila_nivel_1 fila_nivel_2
a            1                0   1        2
             2                3   4        5
b            3                6   7        8
             4                9  10       11

# Reordering and Sorting Levels

## Cambiar Nivel (Swaplevel)

In [29]:
df

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 3     6   7        8
  4     9  10       11

aca cambiamos la fila de nivel uno con la fila de nivel 2

In [30]:
df.swaplevel(0,1)

     Ohio     Colorado
    Green Red    Green
1 a     0   1        2
2 a     3   4        5
3 b     6   7        8
4 b     9  10       11

y acá cambiamos la columna de nivel 1 con la columna de nivel 2

In [31]:
df.swaplevel(0,1,axis=1)

    Green  Red    Green
     Ohio Ohio Colorado
a 1     0    1        2
  2     3    4        5
b 3     6    7        8
  4     9   10       11

## Ordenar por niveles

para esto usamos sort_index(level="nivel a ordenar",axis=1)

In [33]:
df

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 3     6   7        8
  4     9  10       11

In [32]:
df.sort_index(level=1,axis=1)

    Colorado  Ohio
       Green Green Red
a 1        2     0   1
  2        5     3   4
b 3        8     6   7
  4       11     9  10

## Indexing with a DataFrame's Columns

In [50]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),'c': ['one', 'one', 'one', 'two', 'two','two', 'two'],'d': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

### Cambio de indice

#### set_index

para hacer seleccionar un indice de la columna usamos **set_index** pero este borra la columna seleccionada.  
para no eliminarla usamos **drop=False**.

In [64]:
frame.set_index(["c","d"])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [65]:
frame.set_index(["c","d"],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

#### reset_index

este pone los indices como columnas

In [66]:
frame.set_index(["c","d"],inplace=True) # ignorar esto


frame

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [67]:
frame.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

# Combining and Merging Datasets

**atributo how**
![image1](img/img1.png)

In [68]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})
display("df1",df1,
       "df2",df2)

'df1'

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

'df2'

  key  data2
0   a      0
1   b      1
2   d      2